level_2/app/views/messages/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
        <div class="basis-3/4 p-2">
          <p> <%= message.user.first_name %> <%= message.user.last_name %> </p>