level_2/app/views/messages/messages_by_tag.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
            <div class="bg-slate-300 shadow-md hover:shadow-lg rounded p-4">
              <p> <%= message.user.first_name %> <%= message.user.last_name %> </p>