level_2/app/views/messages/show.html.erb

        <div class="text-lg me-5">
          <p>from <%= @message.user.first_name %> <%= @message.user.last_name %> </p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]