level_2/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "tags".* FROM "tags"
---
  def index
    @messages = Message.all
    @tags = Tag.all

INSERT INTO "messages" ("content", "tag_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "yoo le sang"], ["tag_id", 6], ["user_id", 12], ["created_at", "2024-06-21 13:39:20.331200"], ["updated_at", "2024-06-21 13:39:20.331200"]]
---
  def create
    content = params[:content]
    tag_id = params[:tag_id]
    @message = Message.create(
      content:,
      tag_id:,
      user: current_user
    )

SELECT "tags".* FROM "tags" WHERE "tags"."tag" = $1 LIMIT $2  [["tag", "urgent"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."tag_id" = $1  [["tag_id", 4]]
---
  def messages_by_tag
    @tag_name = params[:name]
    tag = Tag.find_by(tag: @tag_name)
    @messages = tag ? Message.where(tag:) : nil